## nsg_amazon_playground plan
```diff
+ Green
- Red
! Orange
@@ Pink @@
#Gray

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.oauth_client.module.oauth_client.tfe_oauth_client.this has been deleted
-   resource "tfe_oauth_client" "this" {
        id               = "oc-Tu1t9KmeUbimZoCc"
        name             = "Terraform Cloud - esg_se_xdr_demo_prod_development"
-       oauth_token_id   = "ot-PgvDkdcFvoMhVQhH" -> null
        # (5 unchanged attributes hidden)
    }

  # module.organization.module.organization.tfe_organization.this[0] has been deleted
-   resource "tfe_organization" "this" {
-       id                                                      = "esg_se_xdr_demo_prod_development" -> null
        name                                                    = "esg_se_xdr_demo_prod_development"
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.oauth_client.module.oauth_client.tfe_oauth_client.this will be created
+   resource "tfe_oauth_client" "this" {
+       api_url          = "https://api.github.com"
+       http_url         = "https://github.com"
+       id               = (known after apply)
+       name             = (known after apply)
+       oauth_token      = (sensitive value)
+       oauth_token_id   = (known after apply)
+       organization     = (known after apply)
+       service_provider = "github"
    }

  # module.organization.module.organization.tfe_organization.this[0] will be created
+   resource "tfe_organization" "this" {
+       collaborator_auth_policy                                = "password"
+       cost_estimation_enabled                                 = true
+       email                                                   = "ralph.brynard@sophos.com"
+       id                                                      = (known after apply)
+       name                                                    = "nsg_amazon_playground_development"
+       send_passing_statuses_for_untriggered_speculative_plans = false
+       session_remember_minutes                                = 20160
+       session_timeout_minutes                                 = 20160
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```